---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.SetUpFromBottom
source: html/29ddd25b-8e8e-9c3e-6828-417dec598e58.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SetUpFromBottom Property

The abbreviation of the Set Up from bottom of fitting(SUB) string.

## Syntax (C#)
```csharp
public string SetUpFromBottom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null